import { useState } from 'react';
import { CenterModal, ModalTitle, ModalCloseTarget } from 'react-spring-modal';
import styled from 'styled-components';

const PolicyContainer = styled.div`
  height: 100%;
  overflow-y: auto;
  overflow-x: hidden;
  h1 {
    font-size: 0.9em;
  }
  p {
    font-size: 0.75em;
  }
  .numeric {
    list-style-type: decimal;
  }
  li {
    margin-bottom: 8px;
  }
`;

const PolicyBody = () => {
  return (
    <PolicyContainer>
      <h1>
        Политика конфиденциальности Политика в отношении обработки персональных
        данных
      </h1>
      <h2>Дата публикации: 25.07.2021 г.</h2>
      <p>
        <h3>Общие положения</h3>
        <ul class='numeric'>
          <li>
            Настоящая политика обработки персональных данных составлена в
            соответствии с требованиями Федерального закона от 27.07.2006.
            №152-ФЗ «О персональных данных» и определяет порядок обработки
            персональных данных и меры по обеспечению безопасности персональных
            данных https://smogopt.ru (далее – Оператор).{' '}
          </li>
          <li>
            Оператор ставит своей важнейшей целью и условием осуществления своей
            деятельности соблюдение прав и свобод человека и гражданина при
            обработке его персональных данных, в том числе защиты прав на
            неприкосновенность частной жизни, личную и семейную тайну.{' '}
          </li>
          <li>
            Настоящая политика Оператора в отношении обработки персональных
            данных (далее – Политика) применяется ко всей информации, которую
            Оператор может получить о посетителях веб-сайта https://smogopt.ru.
          </li>
        </ul>
      </p>
      <p>
        <h3>Основные понятия, используемые в Политике</h3>
        <ul>
          <li>
            Автоматизированная обработка персональных данных – обработка
            персональных данных с помощью средств вычислительной техники;{' '}
          </li>
          <li>
            Блокирование персональных данных – временное прекращение обработки
            персональных данных (за исключением случаев, если обработка
            необходима для уточнения персональных данных);
          </li>
          <li>
            Веб-сайт – совокупность графических и информационных материалов, а
            также программ для ЭВМ и баз данных, обеспечивающих их доступность в
            сети интернет по сетевому адресу https://smogopt.ru;{' '}
          </li>
          <li>
            Информационная система персональных данных — совокупность
            содержащихся в базах данных персональных данных, и обеспечивающих их
            обработку информационных технологий и технических средств;{' '}
          </li>
          <li>
            Обезличивание персональных данных — действия, в результате которых
            невозможно определить без использования дополнительной информации
            принадлежность персональных данных конкретному Пользователю или
            иному субъекту персональных данных;{' '}
          </li>
          <li>
            Обработка персональных данных – любое действие (операция) или
            совокупность действий (операций), совершаемых с использованием
            средств автоматизации или без использования таких средств с
            персональными данными, включая сбор, запись, систематизацию,
            накопление, хранение, уточнение (обновление, изменение), извлечение,
            использование, передачу (распространение, предоставление, доступ),
            обезличивание, блокирование, удаление, уничтожение персональных
            данных;{' '}
          </li>
          <li>
            Оператор – государственный орган, муниципальный орган, юридическое
            или физическое лицо, самостоятельно или совместно с другими лицами
            организующие и (или) осуществляющие обработку персональных данных, а
            также определяющие цели обработки персональных данных, состав
            персональных данных, подлежащих обработке, действия (операции),
            совершаемые с персональными данными;
          </li>
          <li>
            Персональные данные – любая информация, относящаяся прямо или
            косвенно к определенному или определяемому Пользователю веб-сайта
            https://smogopt.ru;{' '}
          </li>
          <li>
            Пользователь – любой посетитель веб-сайта https://smogopt.ru;{' '}
          </li>
          <li>
            {' '}
            Предоставление персональных данных – действия, направленные на
            раскрытие персональных данных определенному лицу или определенному
            кругу лиц;{' '}
          </li>
          <li>
            Распространение персональных данных – любые действия, направленные
            на раскрытие персональных данных неопределенному кругу лиц (передача
            персональных данных) или на ознакомление с персональными данными
            неограниченного круга лиц, в том числе обнародование персональных
            данных в средствах массовой информации, размещение в
            информационно-телекоммуникационных сетях или предоставление доступа
            к персональным данным каким-либо иным способом;{' '}
          </li>
          <li>
            Трансграничная передача персональных данных – передача персональных
            данных на территорию иностранного государства органу власти
            иностранного государства, иностранному физическому или иностранному
            юридическому лицу;{' '}
          </li>
          <li>
            Уничтожение персональных данных – любые действия, в результате
            которых персональные данные уничтожаются безвозвратно с
            невозможностью дальнейшего восстановления содержания персональных
            данных в информационной системе персональных данных и (или)
            результате которых уничтожаются материальные носители персональных
            данных.{' '}
          </li>
          <li>
            «Cookies» — небольшой фрагмент данных, отправленный веб-сервером и
            хранимый на компьютере пользователя, который веб-клиент или
            веб-браузер каждый раз пересылает веб-серверу в HTTP-запросе при
            попытке открыть страницу соответствующего сайта.{' '}
          </li>
          <li>
            «IP-адрес» — уникальный сетевой адрес узла в компьютерной сети,
            построенной по протоколу IP.
          </li>
        </ul>
      </p>
      <p>
        <h3>
          Оператор может обрабатывать следующие персональные данные Пользователя
        </h3>
        <ul>
          <li>Фамилия, имя, отчество; </li>
          <li>Электронный адрес; </li>
          <li>Номера телефонов; </li>
          <li>
            Также на сайте происходит сбор и обработка обезличенных данных о
            посетителях (в т.ч. файлов «cookie») с помощью сервисов
            интернет-статистики (Яндекс.Метрика и Google Analytics, Roistat и
            других).
          </li>
          <li>
            Вышеперечисленные данные далее по тексту Политики объединены общим
            понятием Персональные данные.
          </li>
        </ul>
      </p>
      <p>
        <h3>Цели обработки персональных данных</h3>
        <ul>
          <li>
            Цель обработки персональных данных Пользователя — исполнение
            договора публичной оферты, информирование Пользователя посредством
            отправки электронных писем на адрес электронной почты и
            смс-сообщений на телефонный номер; предоставление доступа
            Пользователю к сервисам, информации и/или материалам, содержащимся
            на веб-сайте.{' '}
          </li>
          <li>
            Также Оператор имеет право направлять Пользователю уведомления о
            новых продуктах и услугах, специальных предложениях и различных
            событиях. Пользователь всегда может отказаться от получения
            информационных сообщений, нажав на ссылку «отписаться», которая
            содержится в любом информационном сообщении, или направив Оператору
            письмо на адрес электронной почты smogopt@yandex.ru с пометкой
            «Отказ от уведомлениях о новых продуктах и услугах и специальных
            предложениях».{' '}
          </li>
          <li>
            Обезличенные данные Пользователей, собираемые с помощью сервисов
            интернет-статистики, служат для сбора информации о действиях
            Пользователей на сайте, улучшения качества сайта и его содержания.
          </li>
        </ul>
      </p>
      <p>
        <h3>Правовые основания обработки персональных данных</h3>
        <ul>
          <li>
            Оператор обрабатывает персональные данные Пользователя только в
            случае их заполнения и/или отправки Пользователем самостоятельно
            через специальные формы, расположенные на сайте https://smogopt.ru и
            всех его страницах. Заполняя соответствующие формы и/или отправляя
            свои персональные данные Оператору, Пользователь выражает свое
            согласие с данной Политикой.{' '}
          </li>
          <li>
            Оператор обрабатывает персональные данные Пользователя на основании
            договора публичной оферты.{' '}
          </li>
          <li>
            Оператор обрабатывает обезличенные данные о Пользователе в случае,
            если это разрешено в настройках браузера Пользователя (включено
            сохранение файлов «cookie» и использование технологии JavaScript).
          </li>
        </ul>
      </p>
      <p>
        <h3>
          Порядок сбора, хранения, передачи и других видов обработки
          персональных данных Безопасность персональных данных, которые
          обрабатываются Оператором, обеспечивается путем реализации правовых,
          организационных и технических мер, необходимых для выполнения в полном
          объеме требований действующего законодательства в области защиты
          персональных данных.
        </h3>
        <ul>
          <li>
            Оператор обеспечивает сохранность персональных данных и принимает
            все возможные меры, исключающие доступ к персональным данным
            неуполномоченных лиц.{' '}
          </li>
          <li>
            Персональные данные Пользователя никогда, ни при каких условиях не
            будут переданы третьим лицам, за исключением случаев, связанных с
            исполнением действующего законодательства.{' '}
          </li>
          <li>
            Оператор вправе передавать персональные данные органам дознания и
            следствия, иным уполномоченным органам по основаниям,
            предусмотренным действующим законодательством Российской Федерации.{' '}
          </li>
          <li>
            В случае выявления неточностей в персональных данных, Пользователь
            может актуализировать их самостоятельно, путем направления Оператору
            уведомление на адрес электронной почты Оператора smogopt@yandex.ru с
            пометкой «Актуализация персональных данных».{' '}
          </li>
          <li>
            Срок обработки персональных данных является неограниченным.
            Пользователь может в любой момент отозвать свое согласие на
            обработку персональных данных, направив Оператору уведомление
            посредством электронной почты на электронный адрес Оператора
            smogopt@yandex.ru с пометкой «Отзыв согласия на обработку
            персональных данных».
          </li>
        </ul>
      </p>
      <p>
        <h3>
          Актуализация, исправление, удаление и уничтожение персональных данных,
          ответы на запросы субъектов на доступ к персональным данным.
        </h3>
        <ul>
          <li>
            В случае подтверждения факта неточности персональных данных или
            неправомерности их обработки, персональные данные подлежат
            актуализации оператором. На время актуализации обработка
            прекращается.{' '}
          </li>
          <li>
            В случае отзыва субъектом персональных данных согласия на их
            обработку, персональные данные подлежат уничтожению Оператором со
            всех бумажных и электронных носителей, а так-же из всех
            автоматизированных систем в установленные законом сроки.{' '}
          </li>
          <li>
            В случае получения заявления о неточности персональных данных
            Оператор подтверждает данный факт, а затем производит актуализацию
            персональных данных с последующим уведомлением субъекта по почте /
            электронным письмом / по телефону.
          </li>
        </ul>
      </p>
      <p>
        <h3>Трансграничная передача персональных данных</h3>
        <ul>
          <li>
            Оператор до начала осуществления трансграничной передачи
            персональных данных обязан убедиться в том, что иностранным
            государством, на территорию которого предполагается осуществлять
            передачу персональных данных, обеспечивается надежная защита прав
            субъектов персональных данных.{' '}
          </li>
          <li>
            Трансграничная передача персональных данных на территории
            иностранных государств, не отвечающих вышеуказанным требованиям,
            может осуществляться только в случае наличия согласия в письменной
            форме субъекта персональных данных на трансграничную передачу его
            персональных данных и/или исполнения договора, стороной которого
            является субъект персональных данных.
          </li>
        </ul>
      </p>
      <p>
        <h3>Заключительные положения</h3>
        <ul>
          <li>
            Пользователь может получить любые разъяснения по интересующим
            вопросам, касающимся обработки его персональных данных, обратившись
            к Оператору с помощью электронной почты smogopt@yandex.ru.{' '}
          </li>
          <li>
            В данном документе будут отражены любые изменения политики обработки
            персональных данных Оператором. Политика действует бессрочно до
            замены ее новой версией. Если определенные пункты политики
            конфиденциальности буду меняться, то все пользователи получат
            извещения о данных переменах на свою электронную почту. Для
            выяснения каких-нибудь вопросов непосредственно с администрацией
            сайта, можно отправить письмо по адресу smogopt@yandex.ru
          </li>
        </ul>
      </p>
    </PolicyContainer>
  );
};

const Button2Text = styled.button`
  background: none;
  border: none;
  color: #ccc;
  cursor: pointer;
  margin: 0;
  padding: 0;
  font-size: 1em;
  text-decoration: underline;
`;

export default function ModalPolicy() {
  const [open, setOpen] = useState(false);
  return (
    <>
      <Button2Text type='button' onClick={() => setOpen(true)}>
        Политикой конфиденциальности
      </Button2Text>
      <CenterModal isOpen={open} onDismiss={() => setOpen(false)}>
        {/* <ModalTitle>
          Политика конфиденциальности Политика в отношении обработки
          персональных данных
        </ModalTitle> */}
        <PolicyBody />
        <ModalCloseTarget>
          <button>
            <p>+</p>
          </button>
        </ModalCloseTarget>
      </CenterModal>
    </>
  );
}
